This proof of concept works
```
  # azuresql_user.user will be created
  + resource "azuresql_user" "user" {
      + authentication = "DBSQLLogin"
      + database       = "sqlserver::myserver:1433:mydb"
      + id             = (known after apply)
      + name           = "test"
      + password       = (sensitive value)
      + principal_id   = (known after apply)
      + sid            = (known after apply)
      + type           = (known after apply)
    }
```

I need some direction to bring this one over the finish line. Tests & docs need to be created, but I wanted your review on the core functionality first.